swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/ram_s/rtl8735b_rtc.c
/**************************************************************************//**
 * @file     rtl8735b_rtc.c
 * @brief    This file implements the RTC HAL functions.
 *
 * @version  V1.00
 * @date     2021-05-13
 *
 * @note
 *
 ******************************************************************************
 *
 * Copyright(c) 2007 - 2017 Realtek Corporation. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************/

#include "cmsis.h"
#include <arm_cmse.h>
#include "rtl8735b_rtc_type.h"
#include "hal_sys_ctrl.h"
#include "hal_irq.h"
#if defined ( __GNUC__ )
#include <limits.h>
#else
#include "__limits.h"
#endif

#if CONFIG_RTC_EN

#define SECTION_RTC_TEXT           //SECTION(".ram.hal_rtc.text")
#define SECTION_RTC_DATA           //SECTION(".ram.hal_rtc.data")
#define SECTION_RTC_RODATA         //SECTION(".ram.hal_rtc.rodata")
#define SECTION_RTC_BSS            //SECTION(".ram.hal_rtc.bss")
#define SECTION_RTC_STUBS          //SECTION(".ram.hal_rtc.stubs")

extern void *memset(void *dst0, int Val, SIZE_T length);

/**
 * @addtogroup ls_hal_rtc RTC
 * @{
 */

//void RTC_IRQHandler(void);

/**
  * @brief The table of RTC registers base address.
  */
SECTION_RTC_RODATA
const RTC_Type *rtc_base_address = { RTC_BASE };//
// rtc //};


/**
  * @brief The global data structure to handle RTC adapters.
  */
SECTION_RTC_BSS hal_rtc_adapter_t *prtc_adapter;

/// @cond DOXYGEN_ROM_HAL_API

/**
 * @addtogroup ls_hal_rtc_rom_func RTC HAL ROM APIs.
 * @ingroup ls_hal_rtc
 * @{
 * @brief The RTC HAL ROM APIs. The user application(in RAM space) should not call these APIs directly.
 *        There is another set of RTC HAL APIs in the RAM space is provided for the user application.
 */

/**
  \brief  The stubs functions table of the RTC HAL functions in ROM.
*/
SECTION_RTC_STUBS const hal_rtc_func_stubs_t hal_rtc_stubs = {
	.prtc_adp = &prtc_adapter,
	//.hal_rtc_irq_handler = RTC_IRQHandler,
	.hal_rtc_comm_irq_reg = hal_rtl_rtc_comm_irq_reg,
	.hal_rtc_comm_irq_unreg = hal_rtl_rtc_comm_irq_unreg,
	.hal_rtc_init = hal_rtl_rtc_init,
	.hal_rtc_deinit = hal_rtl_rtc_deinit,
	.hal_rtc_enable = hal_rtl_rtc_enable,
	.hal_rtc_disable = hal_rtl_rtc_disable,
	//.hal_rtc_isenable = hal_rtc_isenable_rtl8735b,
	.hal_rtc_wait_ctrl_ready = hal_rtl_rtc_wait_ctrl_ready,
	.hal_rtc_write = hal_rtl_rtc_write,
	.hal_rtc_read = hal_rtl_rtc_read,
	.hal_rtc_set_time = hal_rtl_rtc_set_time,
	.hal_rtc_read_time = hal_rtl_rtc_read_time,
	.hal_rtc_set_alarm = hal_rtl_rtc_set_alarm,
	.hal_rtc_read_alarm = hal_rtl_rtc_read_alarm,
	.hal_rtc_reg_alarm_irq = hal_rtl_rtc_reg_alarm_irq,
	.hal_rtc_unreg_alarm_irq = hal_rtl_rtc_unreg_alarm_irq,
	.hal_rtc_set_cnt_alarm = hal_rtl_rtc_set_cnt_alarm,
	.hal_rtc_set_comp = hal_rtl_rtc_set_comp,
};

/**
 *  \brief To handle the RTC interrupt.
 *
 *  \returns void
 */
#if defined (CONFIG_BUILD_SECURE)
typedef void __attribute__((cmse_nonsecure_call)) nsfunc(void);
#endif

SECTION_RTC_TEXT
//void rtc_irq(void)
void RTC_IRQHandler(void)
{

	hal_rtc_adapter_t *prtc_adp;
	prtc_adp = prtc_adapter;
	//u8 buff = 0;
	hal_irq_clear_pending(RTC_IRQn);
	dbg_printf("post clear irq\r\n");
	if (prtc_adp->alarm_callback != NULL) {
#if defined (CONFIG_BUILD_SECURE)
		nsfunc *fp = cmse_nsfptr_create((nsfunc *)(prtc_adp->alarm_callback));
		fp();
#else
		// call the user RTC Alarm callback function
		//(prtc_adp->alarm_callback)(prtc_adp->rtc_cb_para);
		prtc_adp->alarm_callback(prtc_adp);
#endif
	}

	dbg_printf("before clear isr\r\n");
	prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_ISR = 0x1FFFF;     // REG_RTC_ISR, Write 1 Clear
	hal_rtl_rtc_write(prtc_adp, Rtc_Isr, prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_ISR);
	__DSB();


}



/**
 *  \brief To register a IRQ handler for the RTC common interrupt.
 *
 *  \param[in] irq_handler The IRQ handler.
 *
 *  \returns void
 */
SECTION_RTC_TEXT
void hal_rtl_rtc_comm_irq_reg(irq_handler_t irq_handler)
{


	// IRQ vector may has been registered, disable and re-register it
	hal_irq_disable(RTC_IRQn);
	__ISB();
	hal_irq_set_vector(RTC_IRQn, (uint32_t)irq_handler);
	hal_irq_set_priority(RTC_IRQn, RTC_IRQPri);
	hal_irq_enable(RTC_IRQn);

}

/**
 *  \brief To un-register the RTC common IRQ handler.
 *
 *  \returns void
 */
SECTION_RTC_TEXT
void hal_rtl_rtc_comm_irq_unreg(void)
{

	hal_irq_disable(RTC_IRQn);
	__ISB();
	hal_irq_set_vector(RTC_IRQn, (uint32_t)NULL);
}


/**
 *  \brief To initial a RTC devices adapter. This is the first function must be called
 *         before to do any operation to the RTC devices.
 *
 *  \param[in] prtc_adp The RTC devices adapter.
 *
 *  \returns HAL_OK: Initial succeed.
 */
SECTION_RTC_TEXT
hal_status_t hal_rtl_rtc_init(hal_rtc_adapter_t *prtc_adp)  // Weide: Check the entire init function
{
	memset((void *)prtc_adp, 0, sizeof(hal_rtc_adapter_t));
	prtc_adp->base_addr = (RTC_Type *)rtc_base_address;
	prtc_adapter = prtc_adp; // Initialize prtc_adpter
	hal_rtl_rtc_comm_irq_reg((irq_handler_t)RTC_IRQHandler);
	hal_rtl_rtc_enable(prtc_adp);

	return HAL_OK;
}

/**
 *  \brief To de-initial a RTC devices adapter. This is the first function must be called
 *         before to do any operation to the RTC devices.
 *
 *  \param[in] prtc_adp The RTC devices adapter.
 *
 *  \returns HAL_OK: Setting succeed.
 */
SECTION_RTC_TEXT
hal_status_t hal_rtl_rtc_deinit(hal_rtc_adapter_t *prtc_adp)
{

	prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_ISR = 0xFFFFFFFF;     // REG_RTC_ISR, Write 1 Clear

	hal_rtl_rtc_write(prtc_adp, Rtc_Isr, prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_ISR);
	hal_rtl_rtc_comm_irq_unreg();
	hal_rtl_rtc_disable(prtc_adp);
	prtc_adapter = NULL;

	return HAL_OK;

