swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/ram_s/rtl8735b_rtc.c
}


/**
 *  \brief To enable a RTC devive.
 *
 *  \param[in] prtc_adp The RTC device adapter.
 *
 *  \returns void
 */
SECTION_RTC_TEXT
void hal_rtl_rtc_enable(hal_rtc_adapter_t *prtc_adp)
{
	//dbg_printf("hal_rtl_rtc_enable"); //

	AON_TypeDef *aon = AON;
	u32 buff;

	hal_sys_peripheral_en(RTC_SYS, ENABLE);
	hal_delay_ms(4);

	prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_FEN = 0x03; // dont know how to change /
	// First, put data in LSFIF RWD Reg, after which, trigger the LSFIF CMD to write data to RTC contained in LSFIF RWD Reg

	aon->AON_REG_AON_LSFIF_RWD = prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_FEN ; // LSF(low speed function) write*/

	aon->AON_REG_AON_LSFIF_CMD = Rtc_Fen;   // BIT_AON_LSFIF_AD[15:8]=8'h00: RTC register base address
	aon->AON_REG_AON_LSFIF_CMD |= 0xF <<
								  AON_SHIFT_AON_LSFIF_WE; // LSF register byte write enable
	aon->AON_REG_AON_LSFIF_CMD |=
		AON_BIT_AON_LSFIF_WR; // 1: LSF register write transfer, 0: LSF register read transfer
	aon->AON_REG_AON_LSFIF_CMD |=
		AON_BIT_AON_LSFIF_POLL; // Set this bit to do LSF register read or write transfer depend on BIT_AON_LSFIF_WR. When transfer done, this bit will be clear by HW

	// wait rtc ready
	hal_rtl_rtc_wait_ctrl_ready(prtc_adp);   // Waiting for Write Succeed

}



/**
 *  \brief To disable a RTC devive.
 *
 *  \param[in] prtc_adp The RTC device adapter.
 *
 *  \returns void
 */

SECTION_RTC_TEXT
void hal_rtl_rtc_disable(hal_rtc_adapter_t *prtc_adp)
{
	AON_TypeDef *aon = AON;

	hal_sys_peripheral_en(RTC_SYS, DISABLE);
	aon->AON_REG_AON_LSFIF_CMD =
		Rtc_Fen;   // BIT_AON_LSFIF_AD[15:8]=8'h00: RTC register base address
	aon->AON_REG_AON_LSFIF_CMD |= 0xF <<
								  AON_SHIFT_AON_LSFIF_WE; // LSF register byte write enable
	aon->AON_REG_AON_LSFIF_CMD |=
		AON_BIT_AON_LSFIF_WR; // 1: LSF register write transfer, 0: LSF register read transfer
	aon->AON_REG_AON_LSFIF_CMD |=
		AON_BIT_AON_LSFIF_POLL; // Set this bit to do LSF register read or write transfer depend on BIT_AON_LSFIF_WR. When transfer done, this bit will be clear by HW

	// wait rtc ready
	hal_rtl_rtc_wait_ctrl_ready(prtc_adp);   // Waiting for Write Succeed

}




/**
 *  \brief To wait the RTC HW ready to set new RTC register.
 *
 *  \param[in] prtc_adp The RTC device adapter.
 *
 *  \returns void
 */
SECTION_RTC_TEXT
void hal_rtl_rtc_wait_ctrl_ready(hal_rtc_adapter_t *prtc_adp)
{
	AON_TypeDef *aon = AON;

	u32 i;
	for (i = 0; i < 1000000; i++) {
		if ((((aon->AON_REG_AON_LSFIF_CMD) & AON_BIT_AON_LSFIF_POLL) >> AON_SHIFT_AON_LSFIF_POLL) == 0) {
			break;  // break the for loop
		} else {
			hal_delay_ms(1);
		}
	}
}

/**
 *  \brief To Write a RTC register.
 *
 *  \param[in] prtc_adp The RTC device adapter.
 *  \param[in] addr The RTC Reg base address.
 *  \param[in] data The RTC Write Data.
 *
 *  \returns void
 */
SECTION_RTC_TEXT
void hal_rtl_rtc_write(hal_rtc_adapter_t *prtc_adp, u16 addr, u32 data)
{

	AON_TypeDef *aon = AON;

	aon->AON_REG_AON_LSFIF_RWD = data;  // BIT_AON_LSFIF_AD[15:8]=8'h00: RTC register base address
	aon->AON_REG_AON_LSFIF_CMD = addr;   // BIT_AON_LSFIF_AD[15:8]=8'h00: RTC register base address//
	aon->AON_REG_AON_LSFIF_CMD |= 0xF << AON_SHIFT_AON_LSFIF_WE; // LSF register byte write enable
	aon->AON_REG_AON_LSFIF_CMD |= AON_BIT_AON_LSFIF_WR; // 1: LSF register write transfer, 0: LSF register read transferi
	aon->AON_REG_AON_LSFIF_CMD |=
		AON_BIT_AON_LSFIF_POLL; // Set this bit to do LSF register read or write transfer depend on BIT_AON_LSFIF_WR. When transfer done, this bit will be clear by HW
	// wait rtc ready
	hal_rtl_rtc_wait_ctrl_ready(prtc_adp);

}

/**
 *  \brief To Read a RTC register.
 *
 *  \param[in] prtc_adp The RTC device adapter.
 *  \param[in] addr The RTC Reg base address.
 *
 *  \returns HAL_ERR_PARA: Input arguments are invalid.
 *  \returns u32: RTC Data.
 */
SECTION_RTC_TEXT
u32 hal_rtl_rtc_read(hal_rtc_adapter_t *prtc_adp, u16 addr)
{
	AON_TypeDef *aon = AON;
	u32 Data = 0;
	if (prtc_adapter == NULL) {
		DBG_MISC_ERR("hal_rtl_rtc_read RTC Struct isn't Initialize!!\r\n");
		return HAL_ERR_PARA;
	}

	aon->AON_REG_AON_LSFIF_CMD = addr;  // BIT_AON_LSFIF_AD[15:8]=8'h00: RTC register base address
	aon->AON_REG_AON_LSFIF_CMD |= 0xF << AON_SHIFT_AON_LSFIF_WE; // LSF register byte write enable
	aon->AON_REG_AON_LSFIF_CMD &= ~ AON_BIT_AON_LSFIF_WR; // 0: LSF register read transfer
	aon->AON_REG_AON_LSFIF_CMD |=
		AON_BIT_AON_LSFIF_POLL; // Set this bit to do LSF register read or write transfer depend on BIT_AON_LSFIF_WR. When transfer done, this bit will be clear by HW

	// wait rtc ready
	hal_rtl_rtc_wait_ctrl_ready(prtc_adp);
	Data = aon->AON_REG_AON_LSFIF_RWD;          // LSF(low speed function) write*/

	return Data;
}


/**
 *  \brief To set the time of the RTC
 *
 *  \param[in] prtc_adp The RTC device adapter.
 *  \param[in] ptm_reg The tm structure information.hal_rtc_reg_alarm_irq
 *  \param[in] leap_year, Is Leap Year. 1: leap year
 *
 *  \returns     HAL_OK:  Setting succeed.
 *  \returns     HAL_ERR_PARA:  Input arguments are invalid.
 */

SECTION_RTC_TEXT
hal_status_t hal_rtl_rtc_set_time(hal_rtc_adapter_t *prtc_adp, hal_tm_reg_t *ptm_reg, u16 leap_year)
{
	u32 buff_w; // Write Buffer
	hal_status_t ret;
	u8 i = 0;
	AON_TypeDef *aon = AON;

	if (prtc_adapter == NULL) {
		// ////dbg_printf("RTC Struct isn't Initialize!!\r\n");
		return HAL_ERR_PARA;
	}
	if ((ptm_reg->mon > 12) || (ptm_reg->mday > 31) || (ptm_reg->wday > 6) || (ptm_reg->hour > 23) ||
		(ptm_reg->min > 59) || (ptm_reg->sec > 59)) {
		// ////dbg_printf("hal_rtl_rtc_set_time: parameter over-range\r\n");
		return HAL_ERR_PARA;
	}

	// Disable RTC Divider, Reset divider counter
	prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_FEN = BIT_RTC_EN;   // Disable RTC CLK divider
	aon->AON_REG_AON_LSFIF_RWD = prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_FEN; // LSF(low speed function) write*/
	aon->AON_REG_AON_LSFIF_CMD = Rtc_Fen;  // BIT_AON_LSFIF_AD[15:8]=8'h00: RTC register base address
	aon->AON_REG_AON_LSFIF_CMD |= 0xF << AON_SHIFT_AON_LSFIF_WE; // LSF register byte write enable
	aon->AON_REG_AON_LSFIF_CMD |= AON_BIT_AON_LSFIF_WR; // 1: LSF register write transfer, 0: LSF register read transfer
	aon->AON_REG_AON_LSFIF_CMD |=
		AON_BIT_AON_LSFIF_POLL; // Set this bit to do LSF register read or write transfer depend on BIT_AON_LSFIF_WR. When transfer done, this bit will be clear by HW

