swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/ram_s/rtl8735b_rtc.c
	// wait rtc ready
	hal_rtl_rtc_wait_ctrl_ready(prtc_adp);   // Waiting for Write Succeed

	// Set RTC Information
	//TIM0

	prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_TIM0  = (ptm_reg->sec); // Seconds value in the range of 0 to 59
	prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_TIM0  |= ((ptm_reg->min) << BIT_SHIFT_RTC_MIN); // Minutes value in the range of 0 to 593
	prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_TIM0  |= ((ptm_reg->hour) << BIT_SHIFT_RTC_HRS); // Hours value in the range of 0 to 23
	prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_TIM0  |= ((ptm_reg->wday) << BIT_SHIFT_RTC_DOW); // Minutes value in the range of 0 to 593
	hal_rtl_rtc_write(prtc_adp, Rtc_Tim0, prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_TIM0);
	hal_delay_ms(10);//

	//TIM2


	if (leap_year) {// Is leap year?
		prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_TIM2 &= ~(BIT_MASK_RTC_M4ISCYR);   // Year is leap year
	} else {
		prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_TIM2  |= BIT_MASK_RTC_M4ISCYR; // Year is not leap year
	}
	prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_TIM2 |= (ptm_reg->yday + 1);    // Day of year, value in the range of 1 to 366
	hal_rtl_rtc_write(prtc_adp, Rtc_Tim2, prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_TIM2);
	hal_delay_ms(10);//

	//TIM0

	prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_TIM1 = ptm_reg->mday;// Day of month value in the range of 1 to 28, 29, 30, or 31
	prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_TIM1 |= ((ptm_reg->mon + 1) << BIT_SHIFT_RTC_MON) ; // Month value in the range of 1 to 12 s
	prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_TIM1 |= ((ptm_reg->year + 1900) << BIT_SHIFT_RTC_YEAR) ; // Year value in the range of 0 to 4095
	hal_rtl_rtc_write(prtc_adp, Rtc_Tim1, prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_TIM1);
	hal_delay_ms(10);

	// Enable RTC Divider
	prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_FEN = (BIT_CKDIV_EN | BIT_RTC_EN); // Enable RTC CLK divider
	aon->AON_REG_AON_LSFIF_RWD = prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_FEN; // LSF(low speed function) write*/

	aon->AON_REG_AON_LSFIF_CMD = Rtc_Fen;  // BIT_AON_LSFIF_AD[15:8]=8'h00: RTC register base address
	aon->AON_REG_AON_LSFIF_CMD |= 0xF << AON_SHIFT_AON_LSFIF_WE; // LSF register byte write enable
	aon->AON_REG_AON_LSFIF_CMD |= AON_BIT_AON_LSFIF_WR; // 1: LSF register write transfer, 0: LSF register read transfer
	aon->AON_REG_AON_LSFIF_CMD |=
		AON_BIT_AON_LSFIF_POLL; // Set this bit to do LSF register read or write transfer depend on BIT_AON_LSFIF_WR. When transfer done, this bit will be clear by HW

	// wait rtc ready
	hal_rtl_rtc_wait_ctrl_ready(prtc_adp);   // Waiting for Write Succeed

	return HAL_OK;

}


/**
 *  \brief To read the current time of RTC
 *
 *  \param[in] prtc_adp The RTC device adapter.
 *
 *  \returns     HAL_OK:  Setting succeed.
 */
SECTION_RTC_TEXT
u32 hal_rtl_rtc_read_time(hal_rtc_adapter_t *prtc_adp)
{

	prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_TIM0 = hal_rtl_rtc_read(prtc_adp, Rtc_Tim0);
	prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_TIM1 = hal_rtl_rtc_read(prtc_adp, Rtc_Tim1);
	prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_TIM2 = hal_rtl_rtc_read(prtc_adp, Rtc_Tim2);
	return (HAL_OK);

}

/**
 *  \brief To set RTC Alarm
 *
 *  \param[in] prtc_adp The RTC device adapter.
 *  \param[in] prtc_alarm The RTC alarm adapter.
 *
 *  \returns     HAL_OK:  Setting succeed.
 *  \returns     HAL_ERR_PARA:  Input arguments are invalid.
 */
SECTION_RTC_TEXT
hal_status_t hal_rtl_rtc_set_alarm(hal_rtc_adapter_t *prtc_adp, hal_rtc_alarm_t *prtc_alarm)
{
	volatile uint32_t val;


	if (prtc_adapter == NULL) {
		DBG_MISC_ERR("RTC Struct isn't Initialize!!\r\n");
		return HAL_ERR_PARA;
	}

	if ((prtc_alarm->hour > 23) || (prtc_alarm->min > 59) || (prtc_alarm->sec > 59)) {
		DBG_MISC_ERR("hal_rtl_rtc_set_alarm: parameter over-range\r\n");
		return HAL_ERR_PARA;
	}
	// Read RTC Time

	prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_TIM0 = hal_rtl_rtc_read(prtc_adp, Rtc_Tim0);
	prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_TIM2 = hal_rtl_rtc_read(prtc_adp, Rtc_Tim2);
	if (prtc_alarm->yday == ((prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_TIM2 & BIT_MASK_RTC_DOY) >> BIT_SHIFT_RTC_DOY)) { // prevent Isr_doy wouldn't be set
		if (prtc_alarm->hour == ((prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_TIM0 & BIT_MASK_RTC_HRS) >> BIT_SHIFT_RTC_HRS)) { // prevent Isr_hrs wouldn't be set
			if (prtc_alarm->min < ((prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_TIM0 & BIT_MASK_RTC_MIN) >> BIT_SHIFT_RTC_MIN)) {
				DBG_MISC_ERR("hal_rtl_rtc_set_alarm: alarm_min should not less than RTC min\r\n");
				return HAL_ERR_PARA;
			}
		} else if (prtc_alarm->hour < ((prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_TIM0 & BIT_MASK_RTC_HRS) >> BIT_SHIFT_RTC_HRS)) {
			DBG_MISC_ERR("hal_rtl_rtc_set_alarm: alarm_hour should not less than RTC hour\r\n");
			return HAL_ERR_PARA;
		}
	}


	prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_ALRM_CTRL0 &= ~(prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_ALRM_CTRL0 & BIT_MASK_RTC_ALRM_SEC); // clear Second value
	prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_ALRM_CTRL0 |= ((prtc_alarm->sec) << BIT_SHIFT_RTC_ALRM_SEC) ; // Seconds value in the range of 0 to 59
	prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_ALRM_CTRL0 &= ~(prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_ALRM_CTRL0 & BIT_MASK_RTC_ALRM_MIN); // clear Minutes value
	prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_ALRM_CTRL0 |= ((prtc_alarm->min) << BIT_SHIFT_RTC_ALRM_MIN) ; // Minutes value in the range of 0 to 59
	prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_ALRM_CTRL0 &= ~(prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_ALRM_CTRL0 & BIT_MASK_RTC_ALRM_HRS); // clear Hour value
	prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_ALRM_CTRL0 |= ((prtc_alarm->hour) << BIT_SHIFT_RTC_ALRM_HRS); // Min Hours value in the range of 0 to 23
	hal_rtl_rtc_write(prtc_adp, Rtc_Ctrl0, prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_ALRM_CTRL0);


	prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_ALRM_CTRL2 = ((prtc_alarm->yday) << BIT_SHIFT_RTC_ALRM_DOY); // Day of year, value in the range of 1 to 366
	prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_ALRM_CTRL2 |= BIT_MASK_RTC_ALRM_SEC_EN;                // Enable sec,min, hrs, doy Alarm
	prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_ALRM_CTRL2 |= BIT_MASK_RTC_ALRM_MIN_EN;                // Enable sec,min, hrs, doy Alarm
	prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_ALRM_CTRL2 |= BIT_MASK_RTC_ALRM_HRS_EN;                // Enable sec,min, hrs, doy Alarm
	prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_ALRM_CTRL2 |= BIT_MASK_RTC_ALRM_DOY_EN;                // Enable sec,min, hrs, doy Alarm
	hal_rtl_rtc_write(prtc_adp, Rtc_Ctrl2, prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_ALRM_CTRL2);
	hal_delay_ms(5);//

