swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/ram_s/rtl8735b_rtc.c
	prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_IMR |= BIT_RTC_ALRM_IMR;           // Indicate ALL timer value match ALRM value
	hal_rtl_rtc_write(prtc_adp, Rtc_Imr, prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_IMR);

	hal_delay_ms(5);//


	val = AON->AON_REG_AON_SLP_WAKE_EVENT_MSK0;
	//1: enable AON Wakeup event; 0: disable the event to wakeup system //
	val |= (AON_BIT_AON_WEVT_AON_RTC_MSK);
	AON->AON_REG_AON_SLP_WAKE_EVENT_MSK0 = val;

	hal_rtl_rtc_write(prtc_adp, Rtc_Ctrl2, prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_ALRM_CTRL2);
	return HAL_OK;

}

/**
 *  \brief To read the current alarm setting of RTC
 *
 *  \param[in] prtc_adp The RTC device adapter.
 *
 *  \returns     HAL_OK:  Setting succeed.
 */
SECTION_RTC_TEXT
u32 hal_rtl_rtc_read_alarm(hal_rtc_adapter_t *prtc_adp)
{
	prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_IMR = hal_rtl_rtc_read(prtc_adp, Rtc_Imr);

	prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_ALRM_CTRL1 = hal_rtl_rtc_read(prtc_adp, Rtc_Ctrl1);

	prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_ALRM_CTRL0 = hal_rtl_rtc_read(prtc_adp, Rtc_Ctrl0);

	prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_ALRM_CTRL2 = hal_rtl_rtc_read(prtc_adp, Rtc_Ctrl2);

	return HAL_OK;
}


/**
 *  \brief To register the RTC interrupt.
 *
 *  \param[in] prtc_adp The RTC device adapter.
 *  \param[in] callback The callback function. It will be called when the interrupt is occurred.
 *  \param[in] arg The argument of the callback function.
 *
 *  \returns void
 */

SECTION_RTC_TEXT
void hal_rtl_rtc_reg_alarm_irq(hal_rtc_adapter_t *prtc_adp, rtc_alarm_callback_t callback, void *arg)
{

	if (callback != NULL) {
		prtc_adp->alarm_callback = callback;
		prtc_adp->rtc_cb_para = arg;
	} else {
		DBG_MISC_ERR("hal_rtl_rtc_reg_alarm_irq: callback Func is NULL\r\n");
	}
}

/**
 *  \brief To un-register the RTC interrupt.
 *
 *  \param[in] prtc_adp The RTC device adapter.
 *
 *  \returns void
 */

SECTION_RTC_TEXT
void hal_rtl_rtc_unreg_alarm_irq(hal_rtc_adapter_t *prtc_adp)
{

	prtc_adp->alarm_callback = (rtc_alarm_callback_t)NULL;
	prtc_adp->rtc_cb_para = (void *)NULL;
	//hal_rtl_rtc_comm_irq_unreg();

}

/**
 *  \brief To set RTC Cnt Alarm
 *
 *  \param[in] prtc_adp The RTC device adapter.
 *  \param[in] cnt_alarm The RTC alarm paramter. bit 0 -> sec, bit 1 -> min, bit 2 -> hrs, bit 3 -> dow..bit 7 -> doy
 *
 *  \returns     HAL_OK:  Setting succeed.
 *  \returns     HAL_ERR_PARA:  Input arguments are invalid.
 */
SECTION_RTC_TEXT
hal_status_t hal_rtl_rtc_set_cnt_alarm(hal_rtc_adapter_t *prtc_adp, u8 cnt_alarm)
{

	if (prtc_adapter == NULL) {
		DBG_MISC_ERR("RTC Struct isn't Initialize!!\r\n");
		return HAL_ERR_PARA;
	}

	// Set RTC Alarm
	prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_ALRM_CTRL2 = 0; // clear alarm ctrl2
	hal_rtl_rtc_write(prtc_adp, Rtc_Ctrl2, prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_ALRM_CTRL2);
	prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_IMR = cnt_alarm;  // REG_RTC_IMR, Initial rtc_imr REG value
	hal_rtl_rtc_write(prtc_adp, Rtc_Imr, prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_IMR);
	return HAL_OK;

}

/**
 *  @brief To read calibration value of RTC 32K.
 *
 *  @returns The 32k calculation result.
 */

SECTION_RTC_TEXT
u32 hal_rtc_cal_32k_rtl8735b(void)
{
	u32 buff; // Read Buffer

	VNDR_TypeDef *vendor = VNDR;
	if ((((PON->PON_REG_PON_SYSON_CTRL & PON_BIT_VENDOR_REG_EN) >> PON_SHIFT_VENDOR_REG_EN) == 0) ||
		(((PON->PON_REG_PON_SYSON_CTRL & PON_BIT_VENDOR_CLK_EN) >> PON_SHIFT_VENDOR_CLK_EN) == 0)) {
		//if VNDR and SYSON not on, turn on them
		PON->PON_REG_PON_SYSON_CTRL |= 1 << PON_SHIFT_VENDOR_REG_EN ;
		PON->PON_REG_PON_SYSON_CTRL |= 1 << PON_SHIFT_VENDOR_CLK_EN ;
	}
	hal_delay_us(5);
	vendor->VNDR_REG_ANACK_CAL_CTRL = 0x82000000; //REG_ANACK_CAL_CTRLs
	hal_delay_us(1);
	while ((vendor->VNDR_REG_ANACK_CAL_CTRL &  0x80000000) == 0x1) {
		hal_delay_us(1);
	}
	buff = vendor->VNDR_REG_ANACK_CAL_CTRL & 0xFFFF;


	return buff;
}

/**
 *  @brief To read calibration value of RTC 128K.
 *
 *  @returns The 128k calculation result.
 */

SECTION_RTC_TEXT
u32 hal_rtc_cal_128k_rtl8735b(void)
{
	u32 buff; // Read Buffer

	VNDR_TypeDef *vendor = VNDR;

	if ((((PON->PON_REG_PON_SYSON_CTRL & PON_BIT_VENDOR_REG_EN) >> PON_SHIFT_VENDOR_REG_EN) == 0) ||
		(((PON->PON_REG_PON_SYSON_CTRL & PON_BIT_VENDOR_CLK_EN) >> PON_SHIFT_VENDOR_CLK_EN) == 0)) {

		// ////dbg_printf("line 759\n\r "); //
		PON->PON_REG_PON_SYSON_CTRL |= 1 << PON_SHIFT_VENDOR_REG_EN ;
		PON->PON_REG_PON_SYSON_CTRL |= 1 << PON_SHIFT_VENDOR_CLK_EN ;
	}

	hal_delay_us(5);
	vendor->VNDR_REG_ANACK_CAL_CTRL = 0x81000000; //REG_ANACK_CAL_CTRLs
	hal_delay_us(1);

	while ((vendor->VNDR_REG_ANACK_CAL_CTRL &  0x80000000) == 0x1) {
		hal_delay_us(1);

	}
	buff = (vendor->VNDR_REG_ANACK_CAL_CTRL) & 0xFFFF;


	return buff;
}

/**
 *  \brief To set the compensation value of the RTC CLK
 *
 *  \param[in] prtc_adp The RTC device adapter.
 *  \param[in] func_en The RTC compensation function enable. 1: Enable; 0:Disable
 *
 *  \returns     HAL_OK:  Setting succeed.
 *  \returns     HAL_ERR_PARA:  Input arguments are invalid.
 */

SECTION_RTC_TEXT
hal_status_t hal_rtl_rtc_set_comp(hal_rtc_adapter_t *prtc_adp, u8 func_en)
{
	u32 Data = 0;

	/*
	   0000: 40MHz,     0001: 25MHz,
	   0010: 13MHz,     0011: 19.2MHz
	   0100: 20MHz,     0101: 26MHz,
	   0110: 38.4MHz,  0111: 17.664MHz
	   1000: 16MHz,     1001: 14.138MHz
	   1010: 12MHz,     1011:  52MHz
	   1100: 48MHz,     1101: 27MHz,
	   1110: 24MHz,     1111: none
	   */
	u32 buff = 0;
	u32 xtal_sel = 0;
	u8  dir = 0; // 0: plus; 1 mimus
	u8  xtal_ns[16] = {25, 40, 77, 52, 50, 38, 26, 57, 63, 71, 83, 19, 21, 37, 42, 0xff};
	AON_TypeDef *aon = AON;
	//aon_osc_32k_ctrl_t osc_32k_ctrl;

	if (prtc_adapter == NULL) {
		DBG_MISC_ERR("RTC Struct isn't Initialize!!\r\n");
		return HAL_ERR_PARA;
	}

	xtal_sel = (AON->AON_REG_AON_OTP_SYSCFG5) & AON_MASK_XTAL_SEL; // xtal selection, Default=40MHz
	xtal_sel = xtal_sel  & 0xF;
	xtal_sel = 32; // pro2 only have 32

	Data = ((AON->AON_REG_AON_SRC_CLK_CTRL) & AON_MASK_LP_CLK_SEL) >> AON_SHIFT_LP_CLK_SEL;

	if (Data == 0x100) {  // 32768 Xtal
		buff = hal_rtc_cal_32k_rtl8735b();

		if (buff == 0) { // in case buff == 0 will make error
			buff = 1;
		}
		buff = (buff * xtal_sel) >> 3;
		buff = (1000000000 / buff);
		if (buff > 32767) {
			dir = 1;
			if ((buff - 32768) == 0) {
				buff = (0x3FFFF * 10);
				func_en = 0; // The Crystal frequency was accurate, disable comp func
			} else {
				buff = (buff * 10) / (buff - 32768); // 1-(2^15/buff)
			}
		} else {
			dir = 0;
			buff = (buff * 10) / (32768 - buff);
		}


	} else if ((Data == 0x001) || (Data == 0x000)) {  // 128k
		buff = hal_rtc_cal_128k_rtl8735b();
		if (buff == 0) { // in case buff == 0 will make error
			buff = 1;
		}
		buff = (buff * xtal_sel) >> 3;
		buff = (1000000000 / buff);
		if (buff > 131071) {
			dir = 1;
			if ((buff - 131072) == 0) {
				buff = (0x3FFFF * 10);
				func_en = 0; // The Crystal frequency was accurate, disable comp func
			} else {
				buff = (buff * 10) / (buff - 131072); // 1-(2^17/buff)
			}
		} else {
			dir = 0;
			buff = (buff * 10) / (131072 - buff);
		}
	}

	if ((buff % 10) > 4) { // rounding compensation
		buff = buff + 10;
		buff = buff / 10;
	} else {
		buff = buff / 10;
	}

	if (buff > 0x3FFFF) {
		buff = 0x3FFFF;
	} else if (buff > 1) {
		buff = buff - 1;
	}
	// Set RTC Compensation value
	prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_COMP |= ((prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_COMP & RTC_MASK_TYPE_RTC_ADJUST_PERIOD_SEL) <<
			RTC_SHIFT_TYPE_RTC_ADJUST_PERIOD_SEL); //clear
	prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_COMP |= buff << RTC_SHIFT_TYPE_RTC_ADJUST_PERIOD_SEL ;  // unit: s

	prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_COMP |= ((prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_COMP & RTC_BIT_TYPE_ADJUST_DIRECTION) <<
			RTC_SHIFT_TYPE_ADJUST_DIRECTION); //clear
	prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_COMP |= dir << RTC_SHIFT_TYPE_ADJUST_DIRECTION ; // 0: plus; 1 mimus

	prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_COMP |= ((prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_COMP & RTC_BIT_TYPE_FUNCTION_EN) << RTC_SHIFT_TYPE_FUNCTION_EN); //clear
	prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_COMP |= func_en << RTC_SHIFT_TYPE_FUNCTION_EN ;  // 1: Enable; 0:Disable

	hal_rtl_rtc_write(prtc_adp, Rtc_Cmp, prtc_adp->rtc_reg.RTC_TYPE_REG_RTC_COMP);
	return HAL_OK;

}

/** @} */ /* End of group ls_hal_rtc_rom_func */
/// @endcond /* End of condition DOXYGEN_ROM_HAL_API */

/** @} */ /* End of group ls_hal_rtc */

#endif
